{
  "title": "ما هو GIT",

  "whatIsGit": {
    "p1": "<span><strong>Git</strong> هو أشهر نظام مفتوح المصدر للتحكّم في الإصدارات <strong>Distributed Version Control System</strong> في الوقت الحالي، واللي بيساعد فرق العمل على إدارة مشاريعهم على اختلاف أحجامها بسهولة وسرعة، مع الحفاظ على تناسق العمل بين أعضاء الفريق.</span>",
    "p2": "<span>وده بيتم عن طريق تتبّع جميع التعديلات اللي بتطرأ على الملفات وتسجيلها، وتمكين المطوّرين، من خلال وسائل الدمج المختلفة، من توفيق التعديلات دي مع بعض دون فقدان أي جزء منها، بحيث يمتلك كل عضو في الفريق نسخة كاملة من المشروع.</span>"
  },

  "whyVersionControl": {
    "title": "ليه GIT يعتبر Version Control",
    "p1": "<span>لكل مطوّر دور ومهام مطلوبة منه في المشروع، الأمر اللي بيتطلّب إنه يكتب السطور البرمجية المناسبة في الملفات المختلفة، ويدمجها مع باقي المطوّرين، ويرجع يعدّل في نفس الملفات أو يضيف سطور جديدة في ملفات جديدة حسب تسلسل المهام المطلوبة.</span>",
    "p2": "<span>ده معناه إنه لما بينشئ الملف ويعمل فيه أول تعديلات، بيكون كده أنشأ أول نسخة من الملف ده، ولما يرجع يعدّل مرة تانية، بتكون دي نسخة تانية، وهكذا مع استمرار التعديلات.</span>",
    "p3": "<span>هنا يظهر دور <strong>Git</strong>كـ نظام تحكّم في الإصدارات <strong>Version Control</strong>، عن طريق إنه بينظّم الاختلافات بين النسخ ويحافظ على تسلسلها الزمني. ومن خلال ده، يقدر المطوّر يعدّل أو يضيف بسهولة، ويقارن الاختلافات، ويرجع لنسخة قديمة لو احتاج.</span>",
    "p4": "<span>أنظمة التحكم في الإصدارات، ومنها Git، تقدر تعمل ده لأي نوع من الملفات، سواء كانت برمجية، صور، أو بيانات أخرى.</span>"
  },

  "whyDistributed": {
    "title": "ليه GIT يعتبر Distributed",
    "p1": "<span>كل مشروع بيكون له نوعين من أماكن حفظ النسخ البرمجية: أول مكان على الخادم <strong>Server</strong>، وثاني مكان هو الحاسب الآلي الخاص بكل مطوّر، وبينهم بتتم العمليات المختلفة من دمج ومزامنة للملفات.</span>",
    "p2": "<span>نفهم من كده أن <strong>GIT</strong> يعتبر نظام مٌوزَّع <strong>Distributed System</strong> لأنه ببساطة بيوفّر كذا نسخة من المشروع الواحد في أماكن متعددة، بدءًا من الخادم <strong>Server</strong> وانتهاءًا بالنسخ الموجودة على جهاز كل مطوّر، واللي بتكون نسخ كاملة طالما استمرت المزامنة بينها وبين <strong>Server</strong>.</span>",

    "p3": "وده يخلينا ندرك مجموعة مميزات أساسية ومهمة في الأنظمة المُوزَّعة <strong>Distributed Systems</strong>، وهي:",
    "list": {
      "speed": "<span><strong>السرعة:</strong> كل مطوّر لديه نسخة خاصة يمكنه تعديلها على جهازه مباشرة.</span>",
      "reliability": "<span><strong>الاعتمادية:</strong> يمكن بسهولة استبدال نسخة أحد المطوّرين المحتوية على آخر التعديلات بنسخة الخادم<strong>Server</strong> لو حصل خلل في نسخة الخادم<strong>Server</strong>.</span>",
      "collaboration": "<span><strong>التعاونية:</strong> يقدر المطوّرون التعاون عبر العمل على نسخهم الخاصة ودمجها معًا عند الحاجة.</span>"
    }
  }
}
